#  SQLITE3 Data Source

In [1]:
import sqlite3
import mysql.connector
import pymongo
import pandas as pd

In [2]:
con = sqlite3.connect('employees.db')

In [3]:
cursor = con.cursor()

In [4]:
cursor.execute("CREATE TABLE HR(id integer PRIMARY KEY, name text, status text, salary real, department text, position text, hireDate text)")
con.commit()

In [5]:
counter = True
while counter:
    user_id = int(input('Enter your ID: '))
    name = input('Enter your name: ')
    status = input('Enter your status: ')
    salary = float(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('Enter your position: ')
    date = input('Enter date "YYYY-M-D": ')
    entities = (user_id,name,status,salary,department,position,date)
    cursor.execute("INSERT INTO HR(id,name,status,salary,department,position,hireDate) VALUES(?,?,?,?,?,?,?)",entities)
    con.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your ID: 1
Enter your name: Winner Emeto
Enter your status: Yes
Enter your salary: 500
Enter your department: HR
Enter your position: MG
Enter date "YYYY-M-D": 2021-07-8
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your ID: 2
Enter your name: Emeto Winner
Enter your status: NO
Enter your salary: 700
Enter your department: IT
Enter your position: HR
Enter date "YYYY-M-D": 2021-07-8
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your ID: 3
Enter your name: Joy
Enter your status: Yes
Enter your salary: 1500
Enter your department: IT
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-9
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your ID: 4
Enter your name: Mercy
Enter your status: Yes
Enter your salary: 2000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-3
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your ID: 5
Enter your name: Kate
Enter your status: No
Enter your salary: 3000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-5
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

In [6]:
cursor.execute('SELECT * FROM HR')
rows = cursor.fetchall()

In [ ]:
for row in rows:
    print(row)
    print(row[0])

In [7]:
mylist = []

In [8]:
for row in rows:
    mylist.append({'id':row[0], 'name':row[1], 'status':row[2], 'salary':row[3], 'department':row[4], 'position':row[5], 'data':row[6]})

In [9]:
print(mylist)

[{'id': 1, 'name': 'Winner Emeto', 'status': 'Yes', 'salary': 500.0, 'department': 'HR', 'position': 'MG', 'data': '2021-07-8'}, {'id': 2, 'name': 'Emeto Winner', 'status': 'NO', 'salary': 700.0, 'department': 'IT', 'position': 'HR', 'data': '2021-07-8'}, {'id': 3, 'name': 'Joy', 'status': 'Yes', 'salary': 1500.0, 'department': 'IT', 'position': 'IT', 'data': '2021-07-9'}, {'id': 4, 'name': 'Mercy', 'status': 'Yes', 'salary': 2000.0, 'department': 'HR', 'position': 'IT', 'data': '2021-07-3'}, {'id': 5, 'name': 'Kate', 'status': 'No', 'salary': 3000.0, 'department': 'HR', 'position': 'IT', 'data': '2021-07-5'}]

In [10]:
sqlite3_df = pd.DataFrame(mylist)

In [11]:
print(sqlite3_df)

   id          name status  salary department position       data
0   1  Winner Emeto    Yes   500.0         HR       MG  2021-07-8
1   2  Emeto Winner     NO   700.0         IT       HR  2021-07-8
2   3           Joy    Yes  1500.0         IT       IT  2021-07-9
3   4         Mercy    Yes  2000.0         HR       IT  2021-07-3
4   5          Kate     No  3000.0         HR       IT  2021-07-5

# MYSQL Data Source

In [ ]:
mydb = mysql.connector.connect(host="localhost",user="root",password="")

In [13]:
cursor = mydb.cursor()

In [ ]:
cursor.execute("CREATE DATABASE employees")

In [12]:
mydb = mysql.connector.connect(host="localhost",user="root",password="",database="employees")

In [ ]:
cursor.execute("CREATE TABLE IT (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), status VARCHAR(255), salary INT, department VARCHAR(255), position VARCHAR(255), high_date VARCHAR(255))")
mydb.commit()

In [14]:
counter = True
while counter:
    name = input('Enter your name: ')
    status = input('Enter your status')
    salary = int(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('Enter your position: ')
    date = input('Enter date "YYYY-M-D": ')
    vals = (name,status,salary,department,position,date)
    sql = "INSERT INTO IT(name,status,salary,department,position,high_date) VALUES(%s,%s,%s,%s,%s,%s)"
    cursor.execute(sql,vals)
    mydb.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your name: Winner Emeto
Enter your statusYes
Enter your salary: 5000
Enter your department: IT
Enter your position: MG
Enter date "YYYY-M-D": 2021-07-8
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Emeto Winner
Enter your statusYES
Enter your salary: 4500
Enter your department: IT
Enter your position: HR
Enter date "YYYY-M-D": 2021-07-6
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Lilian
Enter your statusYES
Enter your salary: 6000
Enter your department: HR
Enter your position: MG
Enter date "YYYY-M-D": 2021-07-8
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Kate
Enter your statusNo
Enter your salary: 3000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-5
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: Mercy
Enter your statusNO
Enter your salary: 2000
Enter your department: HR
Enter your position: MG
Enter date "YYYY-M-D": 2021-07-1
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit1
Enter your name: John
Enter your statusYES
Enter your salary: 1000
Enter your department: HR
Enter your position: IT
Enter date "YYYY-M-D": 2021-07-3
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

In [15]:
cursor.execute("SELECT * FROM IT")
rows = cursor.fetchall()

In [16]:
mylist = []

In [17]:
for row in rows:
    mylist.append({'id':row[0], 'name':row[1], 'status':row[2], 'salary':row[3], 'department':row[4], 'position':row[5], 'data':row[6]})

In [18]:
mysql_df = pd.DataFrame(mylist)
mysql_df

   id          name status  salary department position       data
0   1        winner    yes     400         hr       it  2021-07-7
1   2  Winner Emeto    Yes    5000         IT       MG  2021-07-8
2   3  Emeto Winner    YES    4500         IT       HR  2021-07-6
3   4        Lilian    YES    6000         HR       MG  2021-07-8
4   5          Kate     No    3000         HR       IT  2021-07-5
5   6         Mercy     NO    2000         HR       MG  2021-07-1
6   7          John    YES    1000         HR       IT  2021-07-3

# Mongo Data Source

In [19]:
myclient = pymongo.MongoClient('mongodb://localhost:27017') #initializing a mongodb connection

In [20]:
mydb = myclient['employees'] #createsadatabase called mydatabase

In [21]:
mycol = mydb['transactions'] #creates a table(collection) called customers

In [ ]:
columns = ["id","name","product","amount","saleprice","status","date"]

In [22]:
counter = True
while counter:
    user_id = input("Id: ")
    name = input("Name: ")
    product= input("Product: ")
    amount = int(input("Amount: "))
    saleprice = float(input("Saleprice: "))
    status = input("Status: ")
    date = input("Date YYYY-M-D: ")

    mydict = {"_id":user_id,"name":name,"product":product,"amount":amount,"saleprice":saleprice,"status":status,"date":date}
    x = mycol.insert_one(mydict)

    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit: "))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Id: 001
Name: Winner Emeto
Product: Laptop
Amount: 1
Saleprice: 1500
Status: Sold
Date YYYY-M-D: 2021-07-8
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 002
Name: Shoe
Product: Shoe
Amount: 200
Saleprice: 3000
Status: Sold
Date YYYY-M-D: 2021-07-4
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 003
Name: Mercy
Product: Shoe
Amount: 3
Saleprice: 3000
Status: Sold
Date YYYY-M-D: 2021-07-2
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 004
Name: Kate
Product: Bag
Amount: 3000
Saleprice: 1000000
Status: Sold
Date YYYY-M-D: 2021-07-1
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 005
Name: Lilian
Product: Hair
Amount: 1500
Saleprice: 1500000
Status: Sold
Date YYYY-M-D: 2021-07-9
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 1
Id: 006
Name: Mary
Product: Hype
Amount: 2000000
Saleprice: 5000000
Status: Sold
Date YYYY-M-D: 2021-07-3
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit: 0
Thank you!!

In [23]:
x = mycol.find()
x

In [24]:
mylist = []

In [25]:
for data in x:
    mylist.append(data)
    print(data)

{'_id': '001', 'name': 'Winner Emeto', 'product': 'Laptop', 'amount': 1, 'saleprice': 1500.0, 'status': 'Sold', 'date': '2021-07-8'}
{'_id': '002', 'name': 'Shoe', 'product': 'Shoe', 'amount': 200, 'saleprice': 3000.0, 'status': 'Sold', 'date': '2021-07-4'}
{'_id': '003', 'name': 'Mercy', 'product': 'Shoe', 'amount': 3, 'saleprice': 3000.0, 'status': 'Sold', 'date': '2021-07-2'}
{'_id': '004', 'name': 'Kate', 'product': 'Bag', 'amount': 3000, 'saleprice': 1000000.0, 'status': 'Sold', 'date': '2021-07-1'}
{'_id': '005', 'name': 'Lilian', 'product': 'Hair', 'amount': 1500, 'saleprice': 1500000.0, 'status': 'Sold', 'date': '2021-07-9'}
{'_id': '006', 'name': 'Mary', 'product': 'Hype', 'amount': 2000000, 'saleprice': 5000000.0, 'status': 'Sold', 'date': '2021-07-3'}

In [26]:
print(mylist)

[{'_id': '001', 'name': 'Winner Emeto', 'product': 'Laptop', 'amount': 1, 'saleprice': 1500.0, 'status': 'Sold', 'date': '2021-07-8'}, {'_id': '002', 'name': 'Shoe', 'product': 'Shoe', 'amount': 200, 'saleprice': 3000.0, 'status': 'Sold', 'date': '2021-07-4'}, {'_id': '003', 'name': 'Mercy', 'product': 'Shoe', 'amount': 3, 'saleprice': 3000.0, 'status': 'Sold', 'date': '2021-07-2'}, {'_id': '004', 'name': 'Kate', 'product': 'Bag', 'amount': 3000, 'saleprice': 1000000.0, 'status': 'Sold', 'date': '2021-07-1'}, {'_id': '005', 'name': 'Lilian', 'product': 'Hair', 'amount': 1500, 'saleprice': 1500000.0, 'status': 'Sold', 'date': '2021-07-9'}, {'_id': '006', 'name': 'Mary', 'product': 'Hype', 'amount': 2000000, 'saleprice': 5000000.0, 'status': 'Sold', 'date': '2021-07-3'}]

In [27]:
mongoDB_df = pd.DataFrame(mylist)
mongoDB_df

   _id          name product   amount  saleprice status       date
0  001  Winner Emeto  Laptop        1     1500.0   Sold  2021-07-8
1  002          Shoe    Shoe      200     3000.0   Sold  2021-07-4
2  003         Mercy    Shoe        3     3000.0   Sold  2021-07-2
3  004          Kate     Bag     3000  1000000.0   Sold  2021-07-1
4  005        Lilian    Hair     1500  1500000.0   Sold  2021-07-9
5  006          Mary    Hype  2000000  5000000.0   Sold  2021-07-3

In [29]:
mongoDB_df['total'] = mongoDB_df['amount'] * mongoDB_df['saleprice']
mongoDB_df

,_id,name,product,amount,saleprice,status,date,total
0,001,Winner Emeto,Laptop,1,1500.0,Sold,2021-07-8,1.500000e+03
1,002,Shoe,Shoe,200,3000.0,Sold,2021-07-4,6.000000e+05
2,003,Mercy,Shoe,3,3000.0,Sold,2021-07-2,9.000000e+03
3,004,Kate,Bag,3000,1000000.0,Sold,2021-07-1,3.000000e+09
4,005,Lilian,Hair,1500,1500000.0,Sold,2021-07-9,2.250000e+09
5,006,Mary,Hype,2000000,5000000.0,Sold,2021-07-3,1.000000e+13

# Pull Data Together

In [30]:
mysql_df

   id          name status  salary department position       data
0   1        winner    yes     400         hr       it  2021-07-7
1   2  Winner Emeto    Yes    5000         IT       MG  2021-07-8
2   3  Emeto Winner    YES    4500         IT       HR  2021-07-6
3   4        Lilian    YES    6000         HR       MG  2021-07-8
4   5          Kate     No    3000         HR       IT  2021-07-5
5   6         Mercy     NO    2000         HR       MG  2021-07-1
6   7          John    YES    1000         HR       IT  2021-07-3

In [31]:
sqlite3_df

   id          name status  salary department position       data
0   1  Winner Emeto    Yes   500.0         HR       MG  2021-07-8
1   2  Emeto Winner     NO   700.0         IT       HR  2021-07-8
2   3           Joy    Yes  1500.0         IT       IT  2021-07-9
3   4         Mercy    Yes  2000.0         HR       IT  2021-07-3
4   5          Kate     No  3000.0         HR       IT  2021-07-5

In [32]:
mongoDB_df

,_id,name,product,amount,saleprice,status,date,total
0,001,Winner Emeto,Laptop,1,1500.0,Sold,2021-07-8,1.500000e+03
1,002,Shoe,Shoe,200,3000.0,Sold,2021-07-4,6.000000e+05
2,003,Mercy,Shoe,3,3000.0,Sold,2021-07-2,9.000000e+03
3,004,Kate,Bag,3000,1000000.0,Sold,2021-07-1,3.000000e+09
4,005,Lilian,Hair,1500,1500000.0,Sold,2021-07-9,2.250000e+09
5,006,Mary,Hype,2000000,5000000.0,Sold,2021-07-3,1.000000e+13

# Creating a Data Warehouse (Using MySQL)

In [34]:
# Connecting to MySQL Server
mydb = mysql.connector.connect(host="localhost",user="root",password="")

In [35]:
# Creating a Cursor object for ex
cursor = mydb.cursor()

In [36]:
# Creating Datawarehouse in MySQL
cursor.execute("CREATE DATABASE datawarehouse")

In [37]:
# Connecting to MySQL Server Datawarehouse
mydb = mysql.connector.connect(host="localhost",user="root",password="",database='datawarehouse')

In [38]:
# Creating a Cursor object for Datawarehouse
cursor = mydb.cursor()

# LOAD FUNCTIONS

In [85]:
def create_table(table_name):
    cursor.execute(f"CREATE TABLE {table_name} (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), status VARCHAR(255), salary INT, department VARCHAR(255), position VARCHAR(255), high_date VARCHAR(255))")
    mydb.commit()

In [91]:
def convert_dataframe(dataframe):
    data_dict = dataframe.to_dict()
    return data_dict

In [95]:
def insert_query(table):
    sql = f"INSERT INTO {table}(name,status,salary,department,position,high_date) VALUES(%s,%s,%s,%s,%s,%s)"
    return sql

In [97]:
def load(data_dict,sql):
    counter = len(data_dict["name"].values())-1

    while counter >= 0:
        global name
        name = data_dict['name'][counter]
        global status
        status = data_dict['status'][counter]
        global salary
        salary = data_dict['salary'][counter]
        global department
        department = data_dict['department'][counter]
        global position
        position = data_dict['position'][counter]
        global date
        date = data_dict['data'][counter]
        vals = (name,status,salary,department,position,date)
        cursor.execute(sql,vals)
        mydb.commit()

        counter -= 1
        if counter == 0:
            print("All data has been inserted!!!")

# LOAD FUNCTIONS FOR MongoDB

In [99]:
def create_table_mdb(table_name):
    cursor.execute(f"CREATE TABLE {table_name} (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), product VARCHAR(255), amount INT, saleprice INT, status VARCHAR(255), date VARCHAR(255), total VARCHAR(255))")
    mydb.commit()

In [100]:
def insert_query_mdb(table):
    sql = f"INSERT INTO {table}(name,product,amount,saleprice,status,date,total) VALUES(%s,%s,%s,%s,%s,%s,%s)"
    return sql

In [108]:
def load_mdb(data_dict,sql):
    counter = len(data_dict["name"].values())-1

    while counter >= 0:
        global name
        name = data_dict['name'][counter]
        global product
        product = data_dict['product'][counter]
        global amount
        amount = data_dict['amount'][counter]
        global saleprice
        saleprice = data_dict['saleprice'][counter]
        global status
        status = data_dict['status'][counter]
        global date
        date = data_dict['date'][counter]
        global total
        total = data_dict['total'][counter]
        vals = (name,product,amount,saleprice,status,date,total)
        cursor.execute(sql,vals)
        mydb.commit()

        counter -= 1
        if counter == 0:
            print("All data has been inserted!!!")

# MySQL Table in Datawarehouse to store MySQL data source

In [ ]:
create_table("IT")

In [80]:
mysql_dict = convert_dataframe(mysql_df)
mysql_dict.pop('id')
mysql_dict

{'name': {0: 'winner',
  1: 'Winner Emeto',
  2: 'Emeto Winner',
  3: 'Lilian',
  4: 'Kate',
  5: 'Mercy',
  6: 'John'},
 'status': {0: 'yes',
  1: 'Yes',
  2: 'YES',
  3: 'YES',
  4: 'No',
  5: 'NO',
  6: 'YES'},
 'salary': {0: 400, 1: 5000, 2: 4500, 3: 6000, 4: 3000, 5: 2000, 6: 1000},
 'department': {0: 'hr', 1: 'IT', 2: 'IT', 3: 'HR', 4: 'HR', 5: 'HR', 6: 'HR'},
 'position': {0: 'it', 1: 'MG', 2: 'HR', 3: 'MG', 4: 'IT', 5: 'MG', 6: 'IT'},
 'data': {0: '2021-07-7',
  1: '2021-07-8',
  2: '2021-07-6',
  3: '2021-07-8',
  4: '2021-07-5',
  5: '2021-07-1',
  6: '2021-07-3'}}

In [ ]:
sql = insert_query("IT")
load(mysql_dict,sql)

# SQLITE3 Table in Datawarehouse to store SQLite3 data source

In [86]:
create_table("HR")

In [93]:
sqlite3_dict = convert_dataframe(sqlite3_df)
sqlite3_dict.pop("id")
sqlite3_dict

{'name': {0: 'Winner Emeto',
  1: 'Emeto Winner',
  2: 'Joy',
  3: 'Mercy',
  4: 'Kate'},
 'status': {0: 'Yes', 1: 'NO', 2: 'Yes', 3: 'Yes', 4: 'No'},
 'salary': {0: 500.0, 1: 700.0, 2: 1500.0, 3: 2000.0, 4: 3000.0},
 'department': {0: 'HR', 1: 'IT', 2: 'IT', 3: 'HR', 4: 'HR'},
 'position': {0: 'MG', 1: 'HR', 2: 'IT', 3: 'IT', 4: 'IT'},
 'data': {0: '2021-07-8',
  1: '2021-07-8',
  2: '2021-07-9',
  3: '2021-07-3',
  4: '2021-07-5'}}

In [96]:
sql = insert_query("HR")
load(sqlite3_dict,sql)

All data has been inserted!!!

# MongoDB Table in Datawarehouse to store MongoDB data source

In [102]:
create_table_mdb("transactions")

In [105]:
mongodb_dict = convert_dataframe(mongoDB_df)
mongodb_dict.pop("_id")
mongodb_dict

{'name': {0: 'Winner Emeto',
  1: 'Shoe',
  2: 'Mercy',
  3: 'Kate',
  4: 'Lilian',
  5: 'Mary'},
 'product': {0: 'Laptop',
  1: 'Shoe',
  2: 'Shoe',
  3: 'Bag',
  4: 'Hair',
  5: 'Hype'},
 'amount': {0: 1, 1: 200, 2: 3, 3: 3000, 4: 1500, 5: 2000000},
 'saleprice': {0: 1500.0,
  1: 3000.0,
  2: 3000.0,
  3: 1000000.0,
  4: 1500000.0,
  5: 5000000.0},
 'status': {0: 'Sold', 1: 'Sold', 2: 'Sold', 3: 'Sold', 4: 'Sold', 5: 'Sold'},
 'date': {0: '2021-07-8',
  1: '2021-07-4',
  2: '2021-07-2',
  3: '2021-07-1',
  4: '2021-07-9',
  5: '2021-07-3'},
 'total': {0: 1500.0,
  1: 600000.0,
  2: 9000.0,
  3: 3000000000.0,
  4: 2250000000.0,
  5: 10000000000000.0}}

In [109]:
sql = insert_query_mdb("transactions")
load_mdb(mongodb_dict,sql)

All data has been inserted!!!